app/controllers/api/trips_controller.rb

  def create
    @trip = Trip.new(trip_params)

    if @trip.save
---
INSERT INTO "trips" ("location", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "Silver Spring, MD"], ["start", Sun, 25 Sep 2016], ["end", Fri, 30 Sep 2016], ["created_at", 2016-08-23 00:09:09 UTC], ["updated_at", 2016-08-23 00:09:09 UTC]]

  def update
    @trip = Trip.find(params[:id])
    if @trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "trips" SET "location" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["location", "Spainj"], ["updated_at", 2016-08-22 20:20:55 UTC], ["id", 1]]

  def destroy
    Trip.delete(params[:id])
    @trips = Trip.all
---
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 9]]
SELECT "trips".* FROM "trips"